Catalogs/ШаблоныДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШаблоныДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МакетДокумента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяСогласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодДокументаКадровогоМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыДокументовКадровыхМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетПодписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяНаличиеВложений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДОБЗК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзменений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныДокументов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ИмяПредопределенныхДанных = "Отсутствие" Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ВидДокумента"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		СсылкаШаблона = ДополнительныеСвойства.СсылкаШаблона;
		УстановитьСсылкуНового(ДополнительныеСвойства.СсылкаШаблона);
		Если Не ЗначениеЗаполнено(Версия) Тогда
			Версия = КабинетСотрудника.ВерсияФормата();
		КонецЕсли;
		Версия = Справочники.ШаблоныДокументов.НормализованныйНомерВерсии(Версия);
	Иначе
		СсылкаШаблона = Ссылка;
	КонецЕсли;
	
	ХешНастроек = Справочники.ШаблоныДокументов.ХешНастроек(
		ВАрхиве, МакетДокумента, СсылкаШаблона.УникальныйИдентификатор());
	
	НастройкиВарианта = Справочники.ШаблоныДокументов.JSONШаблонаДокументаПоИдентификаторуШаблона(МакетДокумента.Получить(), СсылкаШаблона.УникальныйИдентификатор());
	Настройки = Новый ХранилищеЗначения(НастройкиВарианта, Новый СжатиеДанных(9));
	
	Если Не ЭтоНовый() Тогда
		РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ХешНастроек, Версия, Изменен, Настройки");
		Если ХешНастроек <> РеквизитыОбъекта.ХешНастроек Тогда
			ПрежниеНастройкиВарианта = РеквизитыОбъекта.Настройки.Получить();
			Если Справочники.ШаблоныДокументов.JSONШаблоныРазличны(ПрежниеНастройкиВарианта, НастройкиВарианта) Тогда
				СохранитьПрежнююВерсию = Истина;
				Если ЗначениеЗаполнено(ИмяПредопределенныхДанных) Тогда
					ПредопределенныеВерсии = Справочники.ШаблоныДокументов.ПредопределенныеВерсииШаблонов(ИмяПредопределенныхДанных);
					СтрокаВерсии = ПредопределенныеВерсии.Найти(Версия, "Версия");
					Если СтрокаВерсии <> Неопределено
						И Не Справочники.ШаблоныДокументов.JSONШаблоныРазличны(СтрокаВерсии.Настройки, НастройкиВарианта) Тогда
						
						Изменен = Ложь;
					Иначе
						Изменен = Истина;
					КонецЕсли;
					СохранитьПрежнююВерсию = РеквизитыОбъекта.Изменен;
				КонецЕсли;
				Если СохранитьПрежнююВерсию Тогда
					НоваяСтрока = ИсторияИзменений.Добавить();
					НоваяСтрока.Версия = Справочники.ШаблоныДокументов.НормализованныйНомерВерсии(РеквизитыОбъекта.Версия);
					НоваяСтрока.ДатаРегистрации = ТекущаяДатаСеанса();
					НоваяСтрока.Настройки = Новый ХранилищеЗначения(ПрежниеНастройкиВарианта, Новый СжатиеДанных(9));
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(ИмяПредопределенныхДанных) Тогда
				Изменен = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
